dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DMEM_DONE_OFF (0u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DTAG_DONE_OFF (1u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PMEM_DONE_OFF (2u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PTAG_DONE_OFF (3u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DLMU_STBY_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DLMU_STBY_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DLMU_STBY_DONE_OFF (4u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DMEM_DONE_OFF (5u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DTAG_DONE_OFF (6u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PMEM_DONE_OFF (7u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PTAG_DONE_OFF (8u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DLMU_STBY_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DLMU_STBY_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DLMU_STBY_DONE_OFF (9u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DMEM_DONE_OFF (10u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DTAG_DONE_OFF (11u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PMEM_DONE_OFF (12u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PTAG_DONE_OFF (13u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DLMU_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DLMU_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DLMU_DONE_OFF (14u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_OFF (2u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.CPU1_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU1_DMEM1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.CPU1_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU1_DMEM1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.CPU1_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU1_DMEM1_DONE_OFF (3u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.DAM0_DONE */
#define IFX_MTU_MEMDONE1_DAM0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.DAM0_DONE */
#define IFX_MTU_MEMDONE1_DAM0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.DAM0_DONE */
#define IFX_MTU_MEMDONE1_DAM0_DONE_OFF (6u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_MSK (0x1u)

