dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_OFF (13u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_OFF (14u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_OFF (2u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.CPU1_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU1_DMEM1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.CPU1_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU1_DMEM1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.CPU1_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU1_DMEM1_FDA_OFF (3u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.DAM0_FDA */
#define IFX_MTU_MEMFDA1_DAM0_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.DAM0_FDA */
#define IFX_MTU_MEMFDA1_DAM0_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.DAM0_FDA */
#define IFX_MTU_MEMFDA1_DAM0_FDA_OFF (6u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_OFF (9u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.MCDS_FDA */
#define IFX_MTU_MEMFDA1_MCDS_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.MCDS_FDA */
#define IFX_MTU_MEMFDA1_MCDS_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.MCDS_FDA */
#define IFX_MTU_MEMFDA1_MCDS_FDA_OFF (11u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.EMEM0_FDA */
#define IFX_MTU_MEMFDA1_EMEM0_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.EMEM0_FDA */
#define IFX_MTU_MEMFDA1_EMEM0_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.EMEM0_FDA */
#define IFX_MTU_MEMFDA1_EMEM0_FDA_OFF (12u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.EMEM1_FDA */
#define IFX_MTU_MEMFDA1_EMEM1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.EMEM1_FDA */
#define IFX_MTU_MEMFDA1_EMEM1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.EMEM1_FDA */
#define IFX_MTU_MEMFDA1_EMEM1_FDA_OFF (13u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.EMEM2_FDA */
#define IFX_MTU_MEMFDA1_EMEM2_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.EMEM2_FDA */
#define IFX_MTU_MEMFDA1_EMEM2_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.EMEM2_FDA */
#define IFX_MTU_MEMFDA1_EMEM2_FDA_OFF (14u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.EMEM_XTM_FDA */
#define IFX_MTU_MEMFDA1_EMEM_XTM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.EMEM_XTM_FDA */
#define IFX_MTU_MEMFDA1_EMEM_XTM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.EMEM_XTM_FDA */
#define IFX_MTU_MEMFDA1_EMEM_XTM_FDA_OFF (16u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_FIFO_FDA */
#define IFX_MTU_MEMFDA1_GTM_FIFO_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_FIFO_FDA */
#define IFX_MTU_MEMFDA1_GTM_FIFO_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_FIFO_FDA */
#define IFX_MTU_MEMFDA1_GTM_FIFO_FDA_OFF (21u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_MCS0FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS0FAST_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_MCS0FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS0FAST_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_MCS0FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS0FAST_FDA_OFF (23u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_MCS1FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS1FAST_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_MCS1FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS1FAST_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_MCS1FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS1FAST_FDA_OFF (25u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1A_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1A_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1A_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1A_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1A_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1A_FDA_OFF (26u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1BC_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1BC_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1BC_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1BC_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1BC_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1BC_FDA_OFF (27u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL2_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL2_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL2_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL2_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL2_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL2_FDA_OFF (28u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.MCAN10_FDA */
#define IFX_MTU_MEMFDA1_MCAN10_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.MCAN10_FDA */
#define IFX_MTU_MEMFDA1_MCAN10_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.MCAN10_FDA */
#define IFX_MTU_MEMFDA1_MCAN10_FDA_OFF (30u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.MCAN20_FDA */
#define IFX_MTU_MEMFDA1_MCAN20_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.MCAN20_FDA */
#define IFX_MTU_MEMFDA1_MCAN20_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.MCAN20_FDA */
#define IFX_MTU_MEMFDA1_MCAN20_FDA_OFF (31u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.MCAN21_FDA */
#define IFX_MTU_MEMFDA2_MCAN21_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.MCAN21_FDA */
#define IFX_MTU_MEMFDA2_MCAN21_FDA_MSK (0x1u)

